{
    "architectures": [
      "GPT2LMHeadModel"
    ],
    "model_type": "gpt2",
    "attention_probs_dropout_prob": 0.1,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "embedding_dim": 128,
    "hidden_size": 128,
    "initializer_range": 0.02,
    "intermediate_size": 512,
    "const_size": 64,
    "max_role_embeddings": 4,
    "num_attention_heads": 4,
    "type_vocab_size": 2,
    "vocab_size": 30522,
    "encoder_num_hidden_layers": 4,
    "decoder_num_hidden_layers": 1,
    "span_attention_num_layers": 3,
    "pad_token_id": 0,
    "bos_token_id": 2,
    "eos_token_id": 3,
    "window_size": 4,
    "tie_decoder": true,
    "parser_input_dim": 64,
    "parser_hidden_dim": 128,
    "parser_num_layers": 4,
    "parser_nhead": 4,
    "parser_max_len": 1024,
    "fusion_mode": "weighted",
    "n_positions": 1024,
    "n_embd": 128,
    "n_layer": 3,
    "n_head": 4,
    "n_inner": null,
    "activation_function": "gelu_new",
    "resid_pdrop": 0.1,
    "embd_pdrop": 0.1,
    "attn_pdrop": 0.1,
    "layer_norm_epsilon": 1e-05,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "summary_activation": null,
    "summary_proj_to_labels": true,
    "summary_first_dropout": 0.1,
    "scale_attn_weights": true,
    "use_cache": true,
    "scale_attn_by_inverse_layer_idx": false,
    "reorder_and_upcast_attn": false
  }